package org.example.kotlincourse.lessons.lesson07

fun main() {

//// ЗАДАНИЯ ДЛЯ ЦИКЛА FOR
//// Прямой диапазон
//// Напишите цикл for, который выводит числа от 1 до 5.
//    for (i in 1..5) {
//        println(i)
//    }
//
//// Напишите цикл for, который выводит четные числа от 1 до 10.
//    for (i in 1..10) {
//        if (i%2 == 0)
//        println(i)
//    }
//
//// Обратный диапазон
//// Создайте цикл for, который выводит числа от 5 до 1.
//    for (i in 5 downTo 1) {
//        println(i)
//    }
//
// Создайте цикл for, который выводит числа от 10 до 1, уменьшая их на 2.
//    for (i in 10 downTo 1) {
//        println(i - 2)
//    }
//
// С шагом (step)
// Используйте цикл for с шагом 2 для вывода чисел от 1 до 9.
//    for (i in 1..9 step 2) {
//        println(i)
//    }
//
// Напишите цикл for, который выводит каждое третье число в диапазоне от 1 до 20.
//    for (i in 1..20 step 3) {
//        println(i)
//    }
//
//// Использование до (until)
//// Создайте числовую переменную 'size'. Используйте цикл for с шагом 2 для вывода чисел от 3 до size не включая size.
//    val size = 10
//    for (i in 3 until size step 2) {
//        println(i)
//    }

// ЗАДАНИЯ ДЛЯ ЦИКЛА WHILE
// Цикл while
// Создайте цикл while, который выводит квадраты чисел от 1 до 5.
//    val a = 1
//    while (a <= 5) {
//        println(a*a)
//        a++
//    }
//
// Напишите цикл while, который уменьшает число от 10 до 5. После этого вывести результат в консоль
//    val b = 10
//    while (b >= 5) {
//        println(b)
//        b--
//    }
//
// Цикл do while
// Используйте цикл do while, чтобы вывести числа от 5 до 1.
//    val c = 5
//    do {
//        println(c)
//        c--
//    } while (c >= 1)
//
// Создайте цикл do while, который повторяется, пока счетчик меньше 10, начиная с 5.
//    val d = 5
//    do {
//        println(d)
//        d++
//    } while (d < 10)
//
// Задания для прерывания и пропуска итерации
// Использование break
// Напишите цикл for от 1 до 10 и используйте break, чтобы выйти из цикла при достижении 6.
//    for (e in 1..10) {
//        if (e == 6) break
//        println(e)
//    }
//
// Создайте цикл while, который бесконечно выводит числа, начиная с 1, но прерывается при достижении 10.
//    val f = 1
//    while (f >= 1) {
//        if (f == 10) break
//        println(f)
//        f++
//    }
//
// Использование continue
// В цикле for от 1 до 10 используйте continue, чтобы пропустить четные числа.
//    for (g in 1..10) {
//        if (g%2 == 0) continue
//        println(g)
//    }
//
// Напишите цикл while, который выводит числа от 1 до 10, но пропускает числа, кратные 3.
//    val h = 1
//    while (h <= 10) {
//        if (h%3 == 0)
//        println(h)
//        h++
//    }
// ОШИБКА(!)

}